In [1]:
import pandas as pd

In [2]:
import pandas as pd

data   = { 'Name': ['Priyang','Aadhya','Krishna','Vedant','Parshv','Mittal','Archna'],
           'Marks':[98,89,99,87,90,83,99],
           'Gender':['Male','Female','Female','Male','Male','Female','Female']
         }
df = pd.DataFrame(data)

In [3]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6   Archna     99  Female

In [4]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female

In [5]:
df.tail(3)

     Name  Marks  Gender
4  Parshv     90    Male
5  Mittal     83  Female
6  Archna     99  Female

In [6]:
df.shape

(7, 3)

In [7]:
print('Number of Rows',df.shape[0])
print('Number of Cols',df.shape[1])

Number of Rows 7
Number of Cols 3

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [9]:
df.isna().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df.isna().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [11]:
df.isna().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [13]:
df.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [14]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6   Archna     99  Female

In [15]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [16]:
df['Gender'].nunique()

2

In [17]:
df['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [18]:
df['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [19]:
df['Marks'] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [20]:
df[df['Marks'] >= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2  Krishna     99  Female
4   Parshv     90    Male
6   Archna     99  Female

In [21]:
df[(df['Marks'] >= 90) & (df['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2  Krishna     99  Female
4   Parshv     90    Male
6   Archna     99  Female

In [22]:
len(df[(df['Marks'] >= 90) & (df['Marks'] <= 100)])

4

In [23]:
df['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [24]:
sum(df['Marks'].between(90,100))

4

In [25]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6   Archna     99  Female

In [26]:
df['Marks'].mean()

np.float64(92.14285714285714)

In [27]:
df['Marks'].min()

np.int64(83)

In [28]:
df['Marks'].max()

np.int64(99)

In [29]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6   Archna     99  Female

In [30]:
def marks(x):
    return x/2

In [31]:
df['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [32]:
df['Half_marks'] = df['Marks'].apply(marks)

In [33]:
df

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2  Krishna     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6   Archna     99  Female        49.5

In [34]:
def marks2(x):
    return x//2

In [35]:
df['Marks'].apply(marks2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [36]:
df['Half_marks2'] = df['Marks'].apply(marks2)

In [37]:
df

      Name  Marks  Gender  Half_marks  Half_marks2
0  Priyang     98    Male        49.0           49
1   Aadhya     89  Female        44.5           44
2  Krishna     99  Female        49.5           49
3   Vedant     87    Male        43.5           43
4   Parshv     90    Male        45.0           45
5   Mittal     83  Female        41.5           41
6   Archna     99  Female        49.5           49

In [38]:
df['Marks'].apply(lambda x: x / 2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [39]:
df['Name'].apply(len)

0    7
1    6
2    7
3    6
4    6
5    6
6    6
Name: Name, dtype: int64

In [40]:
df

      Name  Marks  Gender  Half_marks  Half_marks2
0  Priyang     98    Male        49.0           49
1   Aadhya     89  Female        44.5           44
2  Krishna     99  Female        49.5           49
3   Vedant     87    Male        43.5           43
4   Parshv     90    Male        45.0           45
5   Mittal     83  Female        41.5           41
6   Archna     99  Female        49.5           49

In [41]:
# male to 1 female to 0
df['Gender'].map({'Male':1, 'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [42]:
df['Male_Female'] = df['Gender'].map({'Male':1, 'Female':0})

In [43]:
df

      Name  Marks  Gender  Half_marks  Half_marks2  Male_Female
0  Priyang     98    Male        49.0           49            1
1   Aadhya     89  Female        44.5           44            0
2  Krishna     99  Female        49.5           49            0
3   Vedant     87    Male        43.5           43            1
4   Parshv     90    Male        45.0           45            1
5   Mittal     83  Female        41.5           41            0
6   Archna     99  Female        49.5           49            0

In [44]:
df['Male_Femaleeeee'] = df['Gender'].map({'Male':1, 'Female':0})

In [45]:
df

,Name,Marks,Gender,Half_marks,Half_marks2,Male_Female,Male_Femaleeeee
0,Priyang,98,Male,49.0,49,1,1
1,Aadhya,89,Female,44.5,44,0,0
2,Krishna,99,Female,49.5,49,0,0
3,Vedant,87,Male,43.5,43,1,1
4,Parshv,90,Male,45.0,45,1,1
5,Mittal,83,Female,41.5,41,0,0
6,Archna,99,Female,49.5,49,0,0

In [46]:
df.drop(['Male_Femaleeeee'],axis=1)

      Name  Marks  Gender  Half_marks  Half_marks2  Male_Female
0  Priyang     98    Male        49.0           49            1
1   Aadhya     89  Female        44.5           44            0
2  Krishna     99  Female        49.5           49            0
3   Vedant     87    Male        43.5           43            1
4   Parshv     90    Male        45.0           45            1
5   Mittal     83  Female        41.5           41            0
6   Archna     99  Female        49.5           49            0

In [47]:
df.drop(['Half_marks','Half_marks2','Male_Female','Male_Femaleeeee'],axis=1,inplace=True)

In [48]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6   Archna     99  Female

In [49]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [50]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [51]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6   Archna     99  Female

In [52]:
df.sort_values(by = 'Marks')

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2  Krishna     99  Female
6   Archna     99  Female

In [53]:
df.sort_values(by = 'Marks', ascending = False)

      Name  Marks  Gender
2  Krishna     99  Female
6   Archna     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [54]:
df.sort_values(by = ['Marks','Gender'], ascending = False)

      Name  Marks  Gender
2  Krishna     99  Female
6   Archna     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [55]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6   Archna     99  Female

In [56]:
df['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [57]:
df['Gender'] == 'Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [58]:
df[df['Gender'] == 'Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2  Krishna     99  Female
5   Mittal     83  Female
6   Archna     99  Female

In [59]:
df[df['Gender'] == 'Female'] ['Name']

1     Aadhya
2    Krishna
5     Mittal
6     Archna
Name: Name, dtype: object

In [60]:
df[df['Gender'] == 'Female'] [['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6   Archna     99

In [61]:
df[df.Gender.isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2  Krishna     99  Female
5   Mittal     83  Female
6   Archna     99  Female

In [62]:
df[df.Gender.isin(['Female'])] [['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6   Archna     99